#### UnitUtils Members

---

|  |
| --- |
| UnitUtils Class   Methods   See Also |

The  UnitUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Convert | Converts a value from one unit to another, such as square feet to square meters. |
| Public method Static member | ConvertFromInternalUnits | Converts a value from Revit's internal units to a given unit. |
| Public method Static member | ConvertToInternalUnits | Converts a value from a given unit to Revit's internal units. |
| Public method Static member | GetAllDisciplines | Gets the identifiers of all available disciplines. |
| Public method Static member | GetAllMeasurableSpecs | Gets the identifiers of all available measurable specs. |
| Public method Static member | GetAllUnits | Gets the identifiers of all available units. |
| Public method Static member | GetDiscipline | Gets the discipline for a given measurable spec. |
| Public method Static member | GetTypeCatalogStringForSpec | Gets the string used in type catalogs to identify a given measurable spec. |
| Public method Static member | GetTypeCatalogStringForUnit | Gets the string used in type catalogs to identify a given unit. |
| Public method Static member | GetValidUnits | Gets the identifiers of all valid units for a given measurable spec. |
| Public method Static member | IsMeasurableSpec | Checks whether a ForgeTypeId identifies a spec associated with units of measurement. |
| Public method Static member | IsSymbol | Checks whether a ForgeTypeId identifies a symbol. |
| Public method Static member | IsUnit | Checks whether a ForgeTypeId identifies a unit. |
| Public method Static member | IsValidUnit | Checks whether a unit is valid for a given measurable spec. |

# See Also

UnitUtils Class

Autodesk.Revit.DB Namespace